app/controllers/admins/sessions_controller.rb

SELECT `users`.* FROM `users` ORDER BY id DESC
---
 def create
    @users = User.all.order("id DESC")