app/controllers/movies_controller.rb

SELECT `movies`.* FROM `movies` ORDER BY id DESC
---
  def index
    @movies = Movie.all.order("id DESC")

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 14 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`movie_id` = 14
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 18 LIMIT 1
---
  def show
    @movie = Movie.find_by(id: params[:id])
    @user = User.find_by(id: @movie.user_id)

    @comment = Comment.new
    @comments = @movie.comments.includes(:user)

INSERT INTO `movies` (`title`, `body`, `image`, `user_id`, `created_at`, `updated_at`, `sub_category`, `category`) VALUES ('パスタ', 'test', 'cc.jpg', 4, '2020-08-31 12:13:44.407529', '2020-08-31 12:13:44.407529', '2', '1')
---
  def create

    @movie = Movie.new(movie_params)
    @movie.user_id = current_user.id
    if @movie.save!

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 18 LIMIT 1
---
  def edit
   @movie = Movie.find(params[:id])

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 18 LIMIT 1
UPDATE `movies` SET `movies`.`title` = 'バックトゥザフューチャー', `movies`.`body` = 'やっぱり面白い', `movies`.`image` = 'images.jpeg', `movies`.`updated_at` = '2020-09-20 04:33:41.203821' WHERE `movies`.`id` = 21
---
 def update
   @movie = Movie.find(params[:id])
   @movie.update(movie_params)